Repository: zhzhwei/docasys
Catalog: app/typo3/typo3conf/l10n/*/rtehtmlarea/Resources/Private/Language/Plugins/TableOperations/*.locallang_csh.xlf
Languages: de

# .alttitle
source: htmlArea RTE > Table Operations
de: htmlArea RTE > Tabellenoperationen

# backgroundColor.alttitle
source: Background color
de: Hintergrundfarbe

# backgroundColor.description
source: Select the color of the background.
de: Wählen Sie die Farbe des Hintergrunds.

# backgroundImage.alttitle
source: URL of background image
de: URL des Hintergrundbildes

# backgroundImage.description
source: Enter the URL of the background image.
de: Geben Sie die URL des Hintergrundbildes ein.

# borderColor.alttitle
source: Border color
de: Rahmenfarbe

# borderColor.description
source: Select the border color.
de: Wählen Sie die Rahmenfarbe aus.

# borderStyle.alttitle
source: Border style
de: Rahmenstil

# borderStyle.description
source: Select the border style.
de: Wählen Sie den Rahmenstil.

# borderWidth.alttitle
source: Border width
de: Rahmenbreite

# borderWidth.description
source: Enter the border width in pixels.
de: Geben Sie die Breite des Rahmens in Pixeln ein.

# caption.alttitle
source: Table caption
de: Tabellenbeschriftung

# caption.description
source: Enter the description of the nature of the table.
de: Geben Sie die Beschreibung der Natur der Tabelle ein.

# caption.details
source: The description entered in this field becomes the content of the table caption. By default, the table caption is center-aligned above a table.
de: Die in diesem Feld eingegebene Beschreibung wird als Tabellenbeschriftung benutzt. Standardmäßig ist die Tabellenbeschriftung zentriert oberhalb der Tabelle angeordnet.

# cellAbbreviation.alttitle
source: Header cell abbreviation
de: Kopfzellenabkürzung

# cellAbbreviation.description
source: Enter the abbreviation of the header cell.
de: Geben Sie eine Abkürzung der Kopfzelle ein.

# Cell_height.alttitle
source: Cell height
de: Zellhöhe

# Cell_height.description
source: Enter the cell height using the selected height unit.
de: Geben Sie die Zellhöhe in der ausgewählten Höheneinheit an.

# cellPadding.alttitle
source: Cell padding
de: Zelleninnenabstand

# cellPadding.description
source: Enter the numer of pixels of space between content and border in cells.
de: Geben Sie die Anzahl an Pixeln Abstand zwischen Inhalt und Rahmen in Zellen an.

# cellSpacing.alttitle
source: Cell spacing
de: Zellenaußenabstand

# cellSpacing.description
source: Enter the numer of pixels of space between adjacent cells.
de: Geben Sie die Anzahl an Pixeln Abstand zwischen benachbarten Zellen an.

# cellType.alttitle
source: Type of cell
de: Zelltyp

# cellType.description
source: Select the type of the cell.
de: Wählen Sie den Typ der Zelle aus.

# Cell_width.alttitle
source: Cell width
de: Zellbreite

# Cell_width.description
source: Enter the cell width using the selected width unit.
de: Geben Sie die Zellbreite in der ausgewählten Breiteneinheit an.

# Class_selector.alttitle
source: Style selector
de: Stilauswahl

# Class_selector.description
source: Apply a style to the current element or remove the style that was last applied.
de: Wenden Sie einen Stil auf das aktuelle Element an oder entfernen Sie den Stil, der zuletzt angewendet wurde.

# collapsedBorders.alttitle
source: Collapsed borders
de: Zusammenfallende Rahmen

# collapsedBorders.description
source: Select whether table borders should be collapsed, detached or default.
de: Wählen Sie aus, ob die Tabellenrahmen zusammenfallend sein sollen, allein stehend sein sollen oder in der Standardeinstellung verbleiben sollen.

# columnCellsType.alttitle
source: Type of cells
de: Zelltyp

# columnCellsType.description
source: Select the type of the cells of this column.
de: Wählen Sie den Typ der Zellen dieser Spalte.

# .description
source: This feature offers multiple tools for creating and editing tables in the RTE editing area.
de: Diese Funktion bietet mehrere Werkzeuge, um im RTE-Bearbeitungsbereich Tabellen zu erstellen und zu bearbeiten.

# .details
source: When this feature is enabled, an "Insert table" button is shown in the editor toolbar. A number of buttons may also appear, usually as the last line of the toolbar. The editor may also be configured so that table operations options appear only in the context menu. All buttons that may be configured are shown below.
de: Wenn diese Funktion aktiviert ist, wird eine "Tabelle einfügen"-Schaltfläche in der Editorwerkzeugleiste angezeigt. Zusätzlich kann eine Anzahl weiterer Schaltflächen angezeigt werden, gewöhnlich in der letzten Zeile der Werkzeugleiste. Der Editor kann allerdings auch so konfiguriert sein, dass Konfigurationsoptionen für Tabellen nur im Kontextmenü erscheinen. Alle Schaltflächen, die konfiguriert werden können, sind unten abgebildet.

# frames.alttitle
source: Frames
de: Umrandung

# frames.description
source: Select which sides should have a border.
de: Wählen Sie aus, welche Seite(n) der Tabelle eine Umrandung haben soll(en).

# Height_unit.alttitle
source: Height unit
de: Höheneinheit

# Height_unit.description
source: Select the height unit.
de: Wählen Sie die Höheneinheit.

# .image_descr
source: "Insert table" icon. Clicking it opens a dialogue that allows to insert a table at the current cursor position. "Table properties" icon. When the cursor is inside a table, clicking it opens a dialogue that allows to edit the properties of the table. "Re-apply table styles" icon. When the cursor is inside a table, clicking it re-calculates the odd/even and counting styles of the table. "Toggle borders" icon. Clicking it shows or hides the borders of all tables in the editing area. "Row properties" icon. When the cursor is inside a table row, clicking it opens a dialogue that allows to edit the properties of the row. "Insert row before" icon. When the cursor is inside a table row, clicking it inserts a new row above this row. "Insert row after" icon. When the cursor is inside a table row, clicking it inserts a new row below this row. "Delete row" icon. When the cursor is inside a table row, clicking it deletes the row from table. "Split row" icon. When the cursor is inside a table cell that was merged over two or more rows, clicking it splits the cell into as many rows as were merged. "Column cells properties" icon. When the cursor is inside a table column, clicking it opens a dialogue that allows to edit the properties of the cells of the column. "Insert column before" icon. When the cursor is inside a table column, clicking it inserts a new column to the left of this column. "Insert column after" icon. When the cursor is inside a table column, clicking it inserts a new column to the right of this column. "Delete column" icon. When the cursor is inside a table column, clicking it deletes the column from the table. "Split column" icon. When the cursor is inside a table cell that was merged over two or more columns, clicking it splits the cell into as many columns as were merged. "Cell properties" icon. When the cursor is inside a table cell, clicking it opens a dialogue that allows to edit the properties of the cell. "Insert cell before" icon. When the cursor is inside a table cell, clicking it inserts a new column to the left of this cell. "Insert cell after" icon. When the cursor is inside a table cell, clicking it inserts a new column to the right of this cell. "Delete cell" icon. When the cursor is inside a table cell, clicking it deletes the cell from the table. "Split cell" icon. When the cursor is inside a table cell that was merged over columns and rows, clicking it splits the cell into as many rows and columns as were merged. "Merge cells" icon. When some table cells are selected, clicking it merges the cells into one cell.
de: Symbol "Tabelle einfügen". Wenn Sie dieses Symbol anklicken, öffnet sich ein Dialog, mit dem Sie eine Tabelle an der aktuellen Mauszeigerposition einfügen können. Symbol "Tabelleneigenschaften". Wenn der Mauszeiger innerhalb einer Tabelle ist, öffnet ein Klick auf dieses Symbol einen Dialog zum Bearbeiten der Tabelleneigenschaften. Symbol "Tabellenstile erneut anwenden". Wenn der Mauszeiger innerhalb einer Tabelle ist, werden mit einem Klick auf dieses Symbol die Stile für gerade und ungerade Zeilen sowie zählende Stile erneut berechnet. Symbol "Rahmen umschalten". Wenn Sie dieses Symbol anklicken, werden die Rahmen aller Tabellen im Bearbeitungsbereich gezeigt oder verborgen. Symbol "Zeileneigenschaften". Wenn der Mauszeiger sich in einer Tabellenzeile befindet, öffnet ein Klick auf diese Schaltfläche einen Dialog, in dem die Eigenschaften der Zeile bearbeitet werden können. Symbol "Zeile darüber einfügen". Wenn der Mauszeiger sich in einer Tabellenzeile befindet, fügt ein Klick auf diese Schaltfläche eine neue Zeile oberhalb dieser Zeile ein. Symbol "Zeile darunter einfügen". Wenn der Mauszeiger sich in einer Tabellenzeile befindet, fügt ein Klick auf diese Schaltfläche eine neue Zeile unterhalb dieser Zeile ein. Symbol "Zeile löschen". Wenn der Mauszeiger sich in einer Tabellenzeile befindet, löscht ein Klick auf diese Schaltfläche diese Tabellenzeile. Symbol "Zeile teilen". Wenn der Mauszeiger sich in einer Tabellenzelle befindet, die sich über zwei oder mehr Zeilen erstreckt, teilt ein Klick auf diese Schaltfläche die Zelle in so viele Zeilen, wie sie umfasste. Symbol "Spaltenzelleigenschaften". Wenn der Mauszeiger sich in einer Tabellenspalte befindet, öffnet ein Klick auf diese Schaltfläche einen Dialog, der es erlaubt, die Eigenschaften der Zellen der Spalte zu bearbeiten. Symbol "Spalte links einfügen". Wenn der Mauszeiger sich in einer Tabellenspalte befindet, fügt ein Klick auf diese Schaltfläche eine neue Spalte links der aktuellen Spalte ein. Symbol "Spalte rechts einfügen". Wenn der Mauszeiger sich in einer Tabellenspalte befindet, fügt ein Klick auf diese Schaltfläche eine neue Spalte rechts der aktuellen Spalte ein. Symbol "Spalte löschen". Wenn der Mauszeiger sich in einer Tabellenspalte befindet, löscht ein Klick auf diese Schaltfläche die Spalte. Symbol "Spalte teilen". Wenn der Mauszeiger sich in einer Tabellenzelle befindet, die sich über zwei oder mehr Spalten erstreckt, teilt ein Klick auf diese Schaltfläche die Zelle in so viele Spalten, wie sie umfasst hat. Symbol "Zelleigenschaften". Wenn der Mauszeiger sich in einer Tabellenzelle befindet, öffnet ein Klick auf diese Schaltfläche einen Dialog, in dem die Eigenschaften der Zelle bearbeitet werden können. Symbol "Zelle davor einfügen". Wenn der Mauszeiger sich in einer Tabellenzelle befindet, fügt ein Klick auf diese Schaltfläche eine neue Zelle links von dieser Zelle ein. Symbol "Zelle danach einfügen". Wenn der Mauszeiger sich in einer Tabellenzelle befindet, fügt ein Klick auf diese Schaltfläche eine neue Zelle rechts von dieser Zelle ein. Symbol "Zelle löschen". Wenn der Mauszeiger sich in einer Tabellenzelle befindet, löscht ein Klick auf diese Schaltfläche die Zelle. Symbol "Zelle teilen". Wenn der Mauszeiger sich in einer Tabellenzelle befindet, die sich über Spalten und Zeilen erstreckte, dann teilt ein Klick auf diese Schaltfläche die Zelle in so viele Zeilen und Spalten, wie sie umfasste. Symbol "Zellen zusammenführen". Wenn mehrere Tabellenzellen ausgewählt sind, fügt ein Klick auf diese Schaltfläche die Zellen zu einer einzigen Zelle zusammen.

# InsertTable.alttitle
source: Insert table
de: Tabelle einfügen

# InsertTable.description
source: Create a new table and insert it into the editing area.
de: Erstellen Sie eine neue Tabelle und fügen Sie sie in den Bearbeitungsbereich ein.

# InsertTable.details
source: Clicking the "Table properties" button opens a dialogue window that allows to create a new table and insert it into the editing area at the current cursor position.
de: Ein Klick auf die Schaltfläche "Tabelleneigenschaften" öffnet ein Dialogfeld, mit dem eine neue Tabelle erstellt und an der aktuellen Mauszeigerposition in den Bearbeitungsbereich eingefügt werden kann.

# InsertTable.image_descr
source: "Insert table" icon.
de: Symbol "Tabelle einfügen".

# numberOfColumns.alttitle
source: Number of columns
de: Anzahl an Spalten

# numberOfColumns.description
source: Enter the number of columns of the table to be created.
de: Geben Sie die Anzahl an Spalten für die zu erstellende Tabelle an.

# numberOfColumns.details
source: Enter in this field the number of columns that the table should have when it is created.
de: Geben Sie in diesem Feld die Anzahl an Spalten an, die die erstellte Tabelle haben soll.

# numberOfRows.alttitle
source: Number of rows
de: Anzahl an Zeilen

# numberOfRows.description
source: Enter the number of rows of the table to be created.
de: Geben Sie die Anzahl an Zeilen für die zu erstellende Tabelle an.

# numberOfRows.details
source: Enter in this field the number of rows that the table should have when it is created.
de: Geben Sie in diesem Feld die Anzahl an Zeilen an, die die erstellte Tabelle haben soll.

# rowGroup.alttitle
source: Row group
de: Zeilengruppe

# rowGroup.description
source: Select to which table part this row should belong.
de: Wählen Sie aus, zu welchem Tabellenteil diese Zeile gehören soll.

# rowGroup.details
source: The row may belong either to the header, body or footer of the table.
de: Die Zeile kann entweder zum Kopf, zum Körper oder zum Fuß der Tabelle gehören.

# Row_height.alttitle
source: Row height
de: Zeilenhöhe

# Row_height.description
source: Enter the row height using the selected height unit.
de: Geben Sie die Zeilenhöhe in der ausgewählten Höheneinheit an.

# Row_width.alttitle
source: Row width
de: Zeilenbreite

# Row_width.description
source: Enter the row width using the selected width unit.
de: Geben Sie die Zeilenbreite in der ausgewählten Breiteneinheit an.

# rules.alttitle
source: Rules
de: Innenränder

# rules.description
source: Select where rules should be displayed.
de: Wählen Sie aus, welche inneren Umrandungen der Tabelle angezeigt werden sollen.

# summary.alttitle
source: Table summary
de: Tabellenzusammenfassung

# summary.description
source: Enter a summary of the table purpose and structure.
de: Geben Sie eine Zusammenfassung von Zweck und Struktur der Tabelle an.

# summary.details
source: The text entered in this field becomes the summary attribute of the table. Note that this attribute is not supported in HTML5.
de: Der in diesem Feld eingegebene Text wird für das summary-Attribut der Tabelle genutzt. Beachten Sie, dass dieses Attribut in HTML5 nicht unterstützt wird.

# Table_body_class_selector.alttitle
source: Table body style selector
de: Tabellenkörperstilauswahl

# Table_body_class_selector.description
source: Apply a style to the body part of the table or remove the style that was last applied.
de: Wenden Sie einen Stil auf den Körper der Tabelle an oder entfernen Sie den Stil, der zuletzt angewendet wurde.

# Table_class_selector.alttitle
source: Table style selector
de: Tabellenstilauswahl

# Table_class_selector.description
source: Apply a style to the table or remove the style that was last applied.
de: Wenden Sie einen Stil auf die Tabelle an oder entfernen Sie den Stil, der zuletzt angewendet wurde.

# tableFloat.alttitle
source: Table float
de: Tabellenumfluss

# tableFloat.description
source: Select whether and how the table should float.
de: Wählen Sie aus, ob und wie die Tabelle umflossen werden soll.

# Table_footer_class_selector.alttitle
source: Table footer style selector
de: Tabellenfußstilauswahl

# Table_footer_class_selector.description
source: Apply a style to the footer part of the table or remove the style that was last applied.
de: Wenden Sie einen Stil auf den Fuß der Tabelle an oder entfernen Sie den Stil, der zuletzt angewendet wurde.

# Table_header_class_selector.alttitle
source: Table header style selector
de: Tabellenkopfstilauswahl

# Table_header_class_selector.description
source: Apply a style to the header part of the table or remove the style that was last applied.
de: Wenden Sie einen Stil auf den Kopf der Tabelle an oder entfernen Sie den Stil, der zuletzt angewendet wurde.

# tableHeaders.alttitle
source: Header cells
de: Kopfzellen

# tableHeaders.description
source: Select the location of table header cells.
de: Wählen Sie den Ort der Kopfzellen der Tabelle aus.

# tableHeaders.details
source: By selecting an option from the list, specify whether the table should have header cells and where they should be located. The options are: 1. No header cells: the table will not have any header cells 2. Header cells on top: only the cells of the topmost row will be header cells and this row will belong to the header part of the table 3. Header cells on left: only the cells of the leftmost column will be header cells 4. Header cells on top and left: the second and third option will both apply.
de: Durch Auswählen einer Option von der Liste legen Sie fest, ob und wo die Tabelle Kopfzellen haben soll. Die Optionen sind: 1. Keine Kopfzellen: Die Tabelle wird keine Kopfzellen haben 2. Kopfzellen oben: Nur die Zellen in der obersten Zeile werden Kopfzellen sein und diese Zeile wird zum Kopf der Tabelle gehören 3. Kopfzellen links: Nur die Zellen in der linken Spalte werden Kopfzellen sein 4. Kopfzellen oben und links: Sowohl die zweite als auch die dritte Option trifft zu.

# Table_height.alttitle
source: Table height
de: Tabellenhöhe

# Table_height.description
source: Enter the table height using the selected height unit.
de: Geben Sie die Höhe der Tabelle in der ausgewählten Höheneinheit an.

# tableStyle.alttitle
source: Table styles
de: Tabellenstile

# tableStyle.description
source: Apply stlyles to the table and to its parts.
de: Wenden Sie Stile auf die Tabelle und ihre Bestandteile an.

# tableStyle.details
source: The "Style" fieldset allows to apply styles to the table and to each of the table parts, i.e. header, body and footer. A selector is displayed for each part that exists in the current table.
de: Das "Stil"-Auswahlfeld erlaubt es, Stile auf die Tabelle und auf jeden ihrer Teile anzuwenden, z.B. auf den Kopf, den Körper und den Fuß. Für jeden Teil, der in der aktuellen Tabelle existiert, wird ein Feld angezeigt.

# Table_width.alttitle
source: Table width
de: Tabellenbreite

# Table_width.description
source: Enter the table width using the selected width unit.
de: Geben Sie die Breite der Tabelle in der ausgewählten Breiteneinheit an.

# textAlignment.alttitle
source: Text alignment
de: Textausrichtung

# textAlignment.description
source: Select the vertical alignment of text within a cell.
de: Wählen Sie die vertikale Ausrichtung von Text in einer Zelle.

# textColor.alttitle
source: Text color
de: Textfarbe

# textColor.description
source: Select the color of the text.
de: Wählen Sie die Farbe des Textes.

# TO_cell_delete.alttitle
source: Delete cell
de: Zelle löschen

# TO_cell_delete.description
source: Delete the current table cell.
de: Löscht die aktuelle Tabellenzelle.

# TO_cell_delete.details
source: Clicking the "Delete cell" button deletes the table cell in which the cursor is currently positioned. If the deleted cell was the last cell of the table, then the table is deleted.
de: Ein Klick auf die "Zelle löschen"-Schaltfläche löscht die Tabellenzelle, in der sich der Mauszeiger im Moment befindet. Wenn die gelöschte Zelle die letzte verbliebene Zelle der Tabelle war, wird die Tabelle gelöscht.

# TO_cell_delete.image_descr
source: "Delete cell" icon.
de: Symbol "Zelle löschen".

# TO_cell_insert_after.alttitle
source: Insert cell after
de: Zelle danach einfügen

# TO_cell_insert_after.description
source: Insert a new cell to the right of the current table cell.
de: Fügen Sie eine neue Zelle rechts von der aktuellen Tabellenzelle ein.

# TO_cell_insert_after.details
source: Clicking the "Insert cell after" button inserts a new cell to the right of the table cell in which the cursor is currently positioned. The new cell is of the same type, i.e. header or data, belongs to the same row, and has the same properties as the cell in which the cursor is currently positioned.
de: Ein Klick auf die "Zelle danach einfügen"-Schaltfläche fügt eine neue Zelle rechts von der Zelle ein, in der sich der Mauszeiger im Moment befindet. Die neue Zelle ist vom selben Typ, z.B. Kopf oder Daten, gehört zur selben Zeile und hat dieselben Eigenschaften wie die aktuelle Zelle.

# TO_cell_insert_after.image_descr
source: "Insert cell after" icon.
de: Symbol "Zelle danach einfügen".

# TO_cell_insert_before.alttitle
source: Insert cell before
de: Zelle davor einfügen

# TO_cell_insert_before.description
source: Insert a new cell to the left the current table cell.
de: Fügen Sie eine neue Zelle links von der aktuellen Tabellenzelle ein.

# TO_cell_insert_before.details
source: Clicking the "Insert cell before" button inserts a new cell to the left of the table cell in which the cursor is currently positioned. The new cell is of the same type, i.e. header or data, belongs to the same row, and has the same properties as the cell in which the cursor is currently positioned.
de: Ein Klick auf die "Zelle davor einfügen"-Schaltfläche fügt eine neue Zelle links von der Zelle ein, in der sich der Mauszeiger im Moment befindet. Die neue Zelle ist vom selben Typ, z.B. Kopf oder Daten, gehört zur selben Zeile und hat dieselben Eigenschaften wie die aktuelle Zelle.

# TO_cell_insert_before.image_descr
source: "Insert cell before" icon.
de: Symbol "Zelle davor einfügen".

# TO_cell_merge.alttitle
source: Merge cells
de: Zellen zusammenführen

# TO_cell_merge.description
source: Merge a set of contiguous table cells.
de: Führt eine Auswahl zusammenhängender Tabellenzellen zusammen.

# TO_cell_merge.details
source: In Firefox, when a set of contiguous table cells have been selected with a mouse movement or through the keyboard, clicking the "Merge cells" button merges the selected cells into a single cell. In other browsers, when the cursor is positioned in a cell, clicking the "Merge cells" button prompts the user for the number of rows to the right and the number of columns down over which the cells should be merged. The set of contiguous cells so defined are then merged.
de: Wenn eine Auswahl zusammenhängender Zellen durch Mausbewegung oder mit der Tastatur in Firefox ausgewählt worden sind, fügt ein Klick auf "Zellen zusammenführen" die ausgewählten Zellen zu einer einzelnen Zelle zusammen. Wenn in anderen Browsern der Mauszeiger sich in einer Zelle befindet, fordert die Schaltfläche "Zellen zusammführen" den Benutzer auf, die Anzahl an Zeilen zur Rechten und Spalten nach unten anzugeben, über die die Zellen zusammengeführt werden sollen. Die Auswahl so festgelegter Zellen wird dann zusammengefügt.

# TO_cell_merge.image_descr
source: "Merge cells" icon.
de: Symbol "Zellen zusammenführen".

# TO_cell_prop.alttitle
source: Cell properties
de: Zelleigenschaften

# TO_cell_prop.description
source: Edit the properties of the table cell in which the cursor is currently positioned.
de: Bearbeiten Sie die Eigenschaften der Zelle, in der sich der Mauszeiger im Moment befindet.

# TO_cell_prop.details
source: Clicking the "Cell properties" button opens a dialogue window that allows to edit the properties of the table cell in which the cursor is currently positioned.
de: Ein Klick auf die Schaltfläche "Zelleigenschaften" öffnet ein Dialogfenster, in dem die Eigenschaften der Tabellenzelle, in der sich der Mauszeiger befindet, bearbeitet werden können.

# TO_cell_prop.image_descr
source: "Cell properties" icon.
de: Symbol "Zelleigenschaften".

# TO_cell_split.alttitle
source: Split cell
de: Zelle teilen

# TO_cell_split.description
source: Split a table cell that was merged over two or more rows and columns.
de: Teilt eine Tabellenzelle, die sich über zwei oder mehr Zeilen und Spalten erstreckt hat.
