Repository: zhzhwei/docasys
Catalog: app/typo3/typo3conf/l10n/*/rtehtmlarea/Resources/Private/Language/Plugins/TableOperations/*.locallang_csh.xlf
Languages: de

# TO_cell_split.details
source: When the cursor is inside a table cell that was merged over two or more rows AND columns, clicking the "Split cell" button splits the cell into as many cells as were merged.
de: Wenn der Mauszeiger sich in einer Tabellenzelle befindet, die sich über zwei oder mehr Zeilen UND Spalten erstreckt hat, dann teilt ein Klick auf diese Schaltfläche die Zelle in so viele Zellen wie über die sie sich erstreckte.

# TO_cell_split.image_descr
source: "Split cell" icon.
de: Symbol "Zelle teilen".

# TO_col_prop.alttitle
source: Column cells properties
de: Spaltenzelleigenschaften

# TO_col_prop.description
source: Edit the properties of the cells of the table column in which the cursor is currently positioned.
de: Bearbeiten Sie die Eigenschaften der Zellen der Tabellenspalte, in der sich der Mauszeiger im Moment befindet.

# TO_col_prop.details
source: Clicking the "Column cells properties" button opens a dialogue window that allows to edit the properties of the cells of the table column in which the cursor is currently positioned. The values of the properties will be applied to all the cells of the column.
de: Ein Klick auf die Schaltfläche "Spaltenzelleigenschaften" öffnet ein Dialogfenster, in dem die Eigenschaften der Zellen der Spalte, in der sich der Mauszeiger im Moment befindet, bearbeitet werden können. Die Werte der Eigenschaften werden auf alle Zellen der Spalte angewendet.

# TO_col_prop.image_descr
source: "Column cells properties" icon.
de: Symbol "Spaltenzelleigenschaften".

# TO_column_delete.alttitle
source: Delete column
de: Spalte löschen

# TO_column_delete.description
source: Delete the current table column.
de: Löscht die aktuelle Tabellenspalte.

# TO_column_delete.details
source: Clicking the "Delete column" button deletes the table column in which the cursor is currently positioned. If the deleted column was the last column of the table, then the table is deleted.
de: Ein Klick auf die Schaltfläche "Spalte löschen" löscht die Spalte, in der sich der Mauszeiger im Moment befindet. Wenn die gelöschte Spalte die letzte verbliebene Spalte der Tabelle war, wird die Tabelle gelöscht.

# TO_column_delete.image_descr
source: "Delete column" icon.
de: Symbol "Spalte löschen".

# TO_column_insert_after.alttitle
source: Insert column after
de: Spalte rechts einfügen

# TO_column_insert_after.description
source: Insert a new column to the right of the current table column.
de: Fügt eine neue Spalte rechts der aktuellen Spalte ein.

# TO_column_insert_after.details
source: Clicking the "Insert column after" button inserts a new column to the right of the table column in which the cursor is currently positioned. The cells of the new column are of the same type, i.e. header for row/row group or data, belong to the same part of the table, i.e. header, body or footer, and have the same properties as the corresponding cells of the column in which the cursor is currently positioned.
de: Ein Klick auf die Schaltfläche "Spalte rechts einfügen" fügt eine neue Spalte rechts der Spalte ein, in der sich der Mauszeiger im Moment befindet. Die Zellen der neuen Spalte sind vom selben Typ, z.B. Kopf für Zeile/Zeilengruppe oder Daten, gehören zum selben Teil der Tabelle, z.B. Kopf, Körper oder Fuß und haben dieselben Eigenschaften wie die entsprechenden Zellen der aktuellen Spalte.

# TO_column_insert_after.image_descr
source: "Insert column after" icon.
de: Symbol "Spalte rechts einfügen".

# TO_column_insert_before.alttitle
source: Insert column before
de: Spalte links einfügen

# TO_column_insert_before.description
source: Insert a new column to the left the current table column.
de: Fügt eine neue Spalte links der aktuellen Spalte ein.

# TO_column_insert_before.details
source: Clicking the "Insert column before" button inserts a new column to the left of the table column in which the cursor is currently positioned. The cells of the new column are of the same type, i.e. header for row/row group or data, belong to the same part of the table, i.e. header, body or footer, and have the same properties as the corresponding cells of the column in which the cursor is currently positioned.
de: Ein Klick auf die Schaltfläche "Spalte links einfügen" fügt eine neue Spalte links der Spalte ein, in der sich der Mauszeiger im Moment befindet. Die Zellen der neuen Spalte sind vom selben Typ, z.B. Kopf für Zeile/Zeilengruppe oder Daten, gehören zum selben Teil der Tabelle, z.B. Kopf, Körper oder Fuß und haben dieselben Eigenschaften wie die entsprechenden Zellen der aktuellen Spalte.

# TO_column_insert_before.image_descr
source: "Insert column before" icon.
de: Symbol "Spalte links einfügen".

# TO_column_split.alttitle
source: Split column
de: Spalte teilen

# TO_column_split.description
source: Split a table cell that was merged over two or more columns.
de: Teilt eine Tabellenzelle, die sich über zwei oder mehr Spalten erstreckt hat.

# TO_column_split.details
source: When the cursor is inside a table cell that was merged over two or more columns, clicking the "Split column" button splits the cell into as many columns as were merged.
de: Wenn der Mauszeiger sich in einer Tabellenzelle befindet, die sich über zwei oder mehr Spalten erstreckt, teilt ein Klick auf diese Schaltfläche die Zelle in so viele Spalten, wie sie umfasste.

# TO_column_split.image_descr
source: "Split column" icon.
de: Symbol "Spalte teilen".

# TO_row_delete.alttitle
source: Delete row
de: Zeile löschen

# TO_row_delete.description
source: Delete the current table row.
de: Löscht die aktuelle Tabellenzeile.

# TO_row_delete.details
source: Clicking the "Delete row" button deletes the table row in which the cursor is currently positioned. If the deleted row was the last row of a part of the table, i.e. header, body or footer, then this part of the table is also deleted. If the deleted row was the last row of the table, then the table is deleted.
de: Ein Klick auf die Schaltfläche "Zeile löschen" löscht die Tabellenzeile, in der sich der Mauszeiger im Moment befindet. Wenn die gelöschte Zeile die letzte verbliebene Zeile eines Tabellenteils war, z.B. des Kopfes, des Körpers oder des Fußes, dann wird dieser Teil ebenfalls gelöscht. Wenn die gelöschte Zeile die letzte verbliebene Zeile der Tabelle war, dann wird die Tabelle gelöscht.

# TO_row_delete.image_descr
source: "Delete row" icon.
de: Symbol "Zeile löschen".

# TO_row_insert_above.alttitle
source: Insert row before
de: Zeile darüber einfügen

# TO_row_insert_above.description
source: Insert a new row above the current table row.
de: Fügt eine neue Zeile oberhalb der aktuellen Zeile ein.

# TO_row_insert_above.details
source: Clicking the "Insert row before" button inserts a new row above the table row in which the cursor is currently positioned. The new row is of the same type, i.e. header or data, as the row in which the cursor is currently positioned, belongs to the same part of the table, i.e. header, body or footer, and has the same properties. The cells of the new row also have the same properties as the corresponding cells of the row in which the cursor is currently positioned.
de: Ein Klick auf die Schaltfläche "Zeile darüber einfügen" fügt eine neue Zeile über der Zeile ein, in der sich der Mauszeiger im Moment befindet. Die neue Zeile ist vom selben Typ, z.B. Kopf oder Daten, wie die Zeile, in der sich der Mauszeiger im Moment befindet, gehört zum selben Teil der Tabelle, z.B. Kopf, Körper oder Fuß und hat dieselben Eigenschaften. Die Zellen der neuen Zeile haben dieselben Eigenschaften wie die entsprechenden Zellen der aktuellen Zeile.

# TO_row_insert_above.image_descr
source: "Insert row before" icon.
de: Symbol "Zeile darüber einfügen".

# TO_row_insert_under.alttitle
source: Insert row after
de: Zeile darunter einfügen

# TO_row_insert_under.description
source: Insert a new row after, or below, the current table row.
de: Fügt eine neue Zeile unterhalb der aktuellen Zeile ein.

# TO_row_insert_under.details
source: Clicking the "Insert row after" button inserts a new row after, or below, the table row in which the cursor is currently positioned. The new row is of the same type, i.e. header or data, as the row in which the cursor is currently positioned, belongs to the same part of the table, i.e. header, body or footer, and has the same properties. The cells of the new row also have the same properties as the corresponding cells of the row in which the cursor is currently positioned.
de: Ein Klick auf die Schaltfläche "Zeile darunter einfügen" fügt eine neue Zeile unter der Zeile ein, in der sich der Mauszeiger im Moment befindet. Die neue Zeile ist vom selben Typ, z.B. Kopf oder Daten, wie die Zeile, in der sich der Mauszeiger im Moment befindet, gehört zum selben Teil der Tabelle, z.B. Kopf, Körper oder Fuß und hat dieselben Eigenschaften. Die Zellen der neuen Zeile haben dieselben Eigenschaften wie die entsprechenden Zellen der aktuellen Zeile.

# TO_row_insert_under.image_descr
source: "Insert row after" icon.
de: Symbol "Zeile darunter einfügen".

# TO_row_prop.alttitle
source: Row properties
de: Zeileneigenschaften

# TO_row_prop.description
source: Edit the properties of the table row in which the cursor is currently positioned.
de: Bearbeiten Sie die Eigenschaften der Tabellenzeile, in der sich der Mauszeiger im Moment befindet.

# TO_row_prop.details
source: Clicking the "Row properties" button opens a dialogue window that allows to edit the properties of the table row in which the cursor is currently positioned.
de: Wenn Sie auf die Schaltfläche "Zeileneigenschaften" klicken, öffnet sich ein Dialogfenster, in dem die Eigenschaften der Tabellenzeile, in der sich der Mauszeiger im Moment befindet, bearbeitet werden können.

# TO_row_prop.image_descr
source: "Row properties" icon.
de: Symbol "Zeileneigenschaften".

# TO_row_split.alttitle
source: Split row
de: Zeile teilen

# TO_row_split.description
source: Split a table cell that was merged over two or more rows.
de: Teilt eine Tabellenzelle, die sich über zwei oder mehr Zeilen erstreckt hat.

# TO_row_split.details
source: When the cursor is inside a table cell that was merged over two or more rows, clicking the "Split row" button splits the cell into as many rows as were merged.
de: Wenn der Mauszeiger sich in einer Tabellenzelle befindet, die sich über zwei oder mehr Zeilen erstreckt hat, teilt ein Klick auf die Schaltfläche "Zeile teilen" die Zelle in so viele Zeilen, wie sie umfasste.

# TO_row_split.image_descr
source: "Split row" icon.
de: Symbol "Zeile teilen".

# TO_table_prop.alttitle
source: Table properties
de: Tabelleneigenschaften

# TO_table_prop.description
source: Edit the properties of the table in which the cursor is currently positioned.
de: Bearbeiten Sie die Eigenschaften der Tabelle, in der der Mauszeiger im Moment positioniert ist.

# TO_table_prop.details
source: Clicking the "Table properties" button opens a dialogue that allows to edit the properties of the table in which the cursor is currently positioned.
de: Ein Klick auf die Schaltfläche "Tabelleneigenschaften" öffnet einen Dialog, der es erlaubt, die Eigenschaften der Tabelle, in der der Mauszeiger sich momentan befindet, zu bearbeiten.

# TO_table_prop.image_descr
source: "Table properties" icon.
de: Symbol "Tabelleneigenschaften"

# TO_table_restyle.alttitle
source: Re-apply table styles
de: Tabellenstile erneut anwenden

# TO_table_restyle.description
source: Re-apply odd/even and/or counting styles to the table in which the cursor is currently positioned.
de: Ungerade und gerade sowie zählende Stile werden erneut auf die unter dem Mauszeiger befindliche Tabelle angewandt.

# TO_table_restyle.details
source: If odd/even and/or counting styles have been applied to the table in which the cursor is currently positioned, some table operations may have broken the layout of the table. Clicking the "Re-apply table styles" button will re-calculate the odd/even and the counting styles, and re-apply the styles to the rows and/or columns of the table.
de: Wenn ungerade/gerade oder zählende Stile auf die Tabelle, in der sich der Mauszeiger aktuell befindet, angewandt worden sind, können einige Tabellenoperationen das Layout der Tabelle beschädigt haben. Ein Klick auf die Schaltfläche "Tabellenstile erneut anwenden" wird die ungeraden/geraden und die zählenden Stile erneut berechnen und sie erneut auf die Zeilen und Spalten der Tabelle anwenden.

# TO_table_restyle.image_descr
source: "Re-apply table styles" icon.
de: Symbol "Tabellenstile erneut anwenden".

# TO_toggle_borders.alttitle
source: Toggle borders
de: Rahmen umschalten

# TO_toggle_borders.description
source: Show/hide the borders of all tables in the editing area.
de: Zeige/verberge die Rahmen aller Tabellen im Bearbeitungsbereich.

# TO_toggle_borders.details
source: Clicking the "Toggle borders" button makes the boundaries of all tables in the editing area visible or, if they are currently visible, the button being highlighted as active, hides these boundaries. This applies only when editing content and has no effect when the element is rendered in the frontend. This button may be configured so that it is activated when the element is opened for editing.
de: Ein Klick auf die "Rahmen umschalten"-Schaltfläche macht die Eingrenzungen aller Tabellen im Bearbeitungsbereich sichtbar oder, wenn sie momentan sichtbar sind und die Schaltfläche hervorgehoben ist, verbirgt sie. Diese Einstellung wirkt sich nur bei der Bearbeitung des Inhalts aus und hat keine Auswirkungen auf das Erscheinungsbild des Inhalts, wenn er im Frontend dargestellt wird. Diese Schaltfläche kann so konfiguriert werden, dass sie, wenn das Element zum Bearbeiten geöffnet wird, aktiviert ist.

# TO_toggle_borders.image_descr
source: "Toggle borders" icon.
de: Symbol "Rahmen umschalten".

# verticalAlignment.alttitle
source: Vertical alignment
de: Vertikale Ausrichtung

# verticalAlignment.description
source: Select the vertical alignment of content within a cell.
de: Wählen Sie die vertikale Ausrichtung von Inhalt in einer Zelle.

# Width_unit.alttitle
source: Width unit
de: Breiteneinheit

# Width_unit.description
source: Select the width unit.
de: Wählen Sie die Breiteneinheit.
