Repository: zhzhwei/docasys
Catalog: app/typo3/typo3conf/l10n/*/rtehtmlarea/Resources/Private/Language/Plugins/Abbreviation/*.locallang_csh.xlf
Languages: de

# abridgedTerm.alttitle
source: Abbreviation
de: Abkürzung

# abridgedTerm.description
source: Select the short form of the term.
de: Wählen Sie die Kurzform des Begriffs.

# .alttitle
source: htmlArea RTE > Abbreviation
de: htmlArea RTE > Abkürzung

# .description
source: The "Abbreviation" dialogue allows to associate an abbreviation to a term.
de: Der "Abkürzung"-Dialog ermöglicht es, einem Begriff eine Abkürzung zuzuordnen.

# .details
source: Clicking the "Insert abbreviation" icon in the RTE tool bar opens a dialogue that allows to insert an abbreviation or to edit one that already exists in the content. Any existing abbreviation is underlined with a broken line and the cursor changes to a question mark when the mouse goes over it. The dialogue allows to associate an abbreviation to a term. The abbreviation may be selected among abbreviations that have been pre-defined in the database or the term being abbreviated may be entered directly in the dialogue.
de: Ein Klick auf das "Abkürzung einfügen"-Symbol in der Werkzeugleiste des RTE öffnet einen Dialog, der es ermöglicht, eine Abkürzung einzufügen oder eine bereits im Inhalt vorhandene Abkürzung zu bearbeiten. Bestehende Abkürzungen werden mit einer unterbrochenen Linie unterstrichen und der Cursor verändert sich zu einem Fragezeichen, wenn die Maus auf der Abkürzung ruht. Der Dialog erlaubt es, einem Begriff eine Abkürzung zuzuordnen. Die Abkürzung kann unter in der Datenbank vordefinierten Abkürzungen ausgewählt oder der abzukürzende Begriff kann direkt im Dialog eingegeben werden.

# .image_descr
source: "Insert abbreviation" icon in the editor tool bar.
de: "Abkürzung einfügen"-Symbol in der Werkzeugleiste.

# language.alttitle
source: Language
de: Sprache

# language.description
source: Select the language for which the abbreviation is defined.
de: Wählen Sie die Sprache, für die die Abkürzung definiert ist.

# language.details
source: The selected language will be set as the language attribute of the abbreviation (or acronym) element. If a pre-defined abbreviation (or acronym) is selected, the language for which it is defined, if any, is initially selected.
de: Die ausgewählte Sprache wird als Language-Attribut des Abkürzungs- oder Akronymelements gesetzt werden. Wenn eine vordefinierte Abkürzung oder ein vordefiniertes Akronym ausgewählt wird, ist die Sprache, für die dieses definiert ist (fall gegeben) vorausgewählt.

# preDefinedAbbreviation.alttitle
source: Pre-defined abbreviations
de: Vordefinierte Abkürzungen

# preDefinedAbbreviation.description
source: This section lets you select abbreviations already defined in the database.
de: Dieser Abschnitt lässt Sie Abkürzungen auswählen, die bereits in der Datenbank definiert sind.

# preDefinedAcronym.alttitle
source: Pre-defined acronyms
de: Vordefinierte Akronyme

# preDefinedAcronym.description
source: This section lets you select acronyms already defined in the database.
de: Dieser Abschnitt lässt Sie Akronyme auswählen, die bereits in der Datenbank definiert sind.

# termToAbridge.alttitle
source: Term to abbreviate
de: Abzukürzender Begriff

# termToAbridge.description
source: This section lets you enter the unabbreviated term for which the currently selected text will be the short form.
de: Dieser Abschnitt lässt Sie den nicht-abgekürzten Begriff angeben, für den der aktuell-ausgewählte Text die Kurzform ist.

# unabridgedTerm.alttitle
source: Unabbreviated term
de: Nicht-abgekürzter Begriff

# unabridgedTerm.description
source: Select the unabbreviated form of the term.
de: Wählen Sie die nicht-abgekürzte Form des Begriffs.

# unabridgedTerm.details
source: The selected term will be set as the title attribute of the abbreviation (or acronym) element.
de: Der ausgewählte Begriff wird als Title-Attribut des Abkürzungs- bzw. Akronymelements gesetzt werden.

# useThisTerm.alttitle
source: Use this term
de: Diesen Begriff verwenden

# useThisTerm.description
source: Enter the term that you want to associate as the unabbreviated form of the currently selected text.
de: Geben Sie den Begriff an, den Sie als nicht-abgekürzte Form mit dem aktuell-ausgewählten Text verbinden möchten.

# useThisTerm.details
source: The entered term will be set as the title attribute of the abbreviation (or acronym) element.
de: Der eingegebene Begriff wird als Title-Attribut des Abkürzungs- oder Akronymelements gesetzt werden.
