Repository: zhzhwei/docasys
Catalog: app/typo3/typo3conf/l10n/*/rtehtmlarea/Resources/Private/Language/Plugins/RemoveFormat/*.locallang_csh.xlf
Languages: de

# all.alttitle
source: Remove format on all contents
de: Formatierungen im gesamten Inhalt entfernen

# all.description
source: Select this option to perform the format removal operation on the whole contents of the editing area.
de: Wählen Sie diese Option, um die Formatierung für den gesamten Inhalt zu entfernen.

# allHtml.alttitle
source: Remove all HTML format
de: Alle HTML-Formatierungen entfernen

# allHtml.description
source: Check this option if you wish to remove all HTML format.
de: Aktivieren Sie diese Option, wenn Sie alle HTML-Formatierungen zu entfernen möchten.

# allHtml.details
source: This option removes all HTML markup from the selected text.
de: Diese Option entfernt alle HTML-Auszeichnungen vom ausgewählten Text.

# .alttitle
source: htmlArea RTE > Remove Format
de: htmlArea RTE > Formatierung entfernen

# area.alttitle
source: Select the area to be cleaned
de: Wählen Sie den Bereich aus, der bereinigt werden soll

# area.description
source: The format removal operation may be applied either to the currently highlighted text or to the whole contents of the editing area.
de: Die Funktion "Formatierung entfernen" kann auf den aktuell ausgewählten Inhalt oder auf den gesamten Inhalt des Bearbeitungsbereichs angewandt werden.

# area.details
source: Use one of these two radio buttons to select the area to which you wish to apply the format removal operation.
de: Bitte wählen Sie eine der beiden Auswahlknöpfe, um den Anwendungsbereich für die Durchführung der Funktion "Formatierung entfernen" zu bestimmen.

# .description
source: The Remove Format feature offers options for cleaning up the HTML markup of the text being edited.
de: Die Funktion "Formatierung entfernen" bietet Möglichkeiten, den HTML-Code des im RTE-Bearbeitungsbereich ausgewählten Inhalts zu bereinigen.

# .details
source: This feature may be useful in order to clean up text that was copied from some external source and pasted into the editing area. The feature is accessed by clicking on the "Remove format" button in the editor tool bar. In the dialogue window that opens when the button is clicked: - First, select the area to be cleaned; - Second, choose the format removal options that you wish to be applied to the selected area; - Press the OK button for the format removal operation to be performed. The dialogue window will be automatically closed.
de: Diese Funktion ist nützlich um Text zu bereinigen, der von einer externen Quelle kopiert und in den Editor eingefügt wurde. Die Funktion kann über die "Formatierung entfernen"-Schaltfläche in der Editorwerkzeugleiste benutzt werden. In dem Dialogfenster, das sich öffnet, wenn die Schaltfläche angeklickt wurde: - Wählen Sie zunächst den Bereich, der bereinigt werden soll; - Wählen Sie danach die Formatbereinigungsoptionen, die auf diesen Bereich angewendet werden sollen; - Klicken Sie auf die "OK"-Schaltfläche, um die Bereinigung durchzuführen. Das Dialogfenster wird dann automatisch geschlossen.

# htmlFormat.alttitle
source: Remove all HTML inline markup and style
de: Alle MS-Word-Markierungen und Stile entfernen

# htmlFormat.description
source: Check this option if you wish to remove all HTML inline markup and style.
de: Markieren Sie diese Option, wenn sie ds gesamte HTML-Inline-Marup und alle Stile entfernen möchten.

# htmlFormat.details
source: This option removes: - the following HTML elements, but keeps their textual contents: abbr, acronym, b, big, cite, code, em, font, i, q, s, samp, small, span, strike, strong, sub, sup, tt, u, var; - the following attributes on all HTML elements: align, bgcolor, cellpadding, cellspacing, class, frame, style.
de: Diese Option entfernt: - die folgenden HTML-Elemente, aber sie behält deren Textinhalte: abbr, acronym, b, big, cite, code, em, font, i, q, s, samp, small, span, strike, strong, sub, sup, tt, u, var; - die folgenden Attribute aller HTML-Elemente: align, bgcolor, cellpadding, cellspacing, class, frame, style.

# .image_descr
source: Remove format icon in the editor tool bar.
de: Symbol "Formatierung entfernen" in der RTE-Werkzeugleiste.

# images.alttitle
source: Remove images
de: Bilder entfernen

# images.description
source: Check this option if you wish to remove all images.
de: Aktivieren Sie diese Option, wenn Sie alle Bilder entfernen möchten.

# images.details
source: This option removes all images from the selected text.
de: Diese Option entfernt alle Bilder aus dem ausgewählten Text.

# msWordFormat.alttitle
source: Remove all MS Word markup and style
de: Alle MS Word Markierungen und Stile entfernen

# msWordFormat.description
source: Check this option if you wish to remove all MS Word markup and style.
de: Markieren Sie diese Option, wenn Sie Markup und Stile von Microsoft Word entfernen möchten.

# msWordFormat.details
source: This option removes: - all attributes on the following elements: b, em, i, li, p, strong, ul; - the following attributes on all HTML elements: align, class, style; - the following elements, but keeps their textual contents: div, f, formulas, link, lock, meta, path, shape, shapetype, span, stroke, ?xml, any element containing ":" in its name; - the following elements and their contents: style, title; - HTML comments; - img, imagedata tags; - xml tags; - the following elements whenever they have no textual contents: b, big, i, s, small, strike, tt, u; - double opening and double closing tags; - multiples spaces, replacing them by single spaces.
de: Diese Option entfernt: - alle Attribute der folgenden Elemente: b, em, i, li, p, strong, ul; - die folgenden Attribute aller HTML-Elemente: align, class, style; - die folgenden Elemente, aber sie behält deren Textinhalte: div, f, formulas, link, lock, meta, path, shape, shapetype, span, stroke, ?xml, jegliche Elemente mit ":" in ihrem Namen; - die folgenden Elemente und ihre Inhalte: style, title; - HTML-Kommentare; - img-, imagedata-Tags; - xml-Tags; - die folgenden Elemente sofern sie keine Textinhalte haben: b, big, i, s, small, strike, tt, u; - doppelte öffnende und doppelte schließende Tags - mehrfache Leerzeichen; sie werden durch ein einzelnes Leerzeichen ersetzt.

# nonBreakingSpace.alttitle
source: Replace non-breaking spaces
de: Geschützte Leerzeichen ersetzen

# nonBreakingSpace.description
source: Check this option if you wish to replace non-breaking spaces with normal spaces.
de: Aktivieren Sie diese Option, wenn Sie geschützte Leerzeichen durch normale Leerzeichen ersetzen möchten.

# nonBreakingSpace.details
source: This option replaces any non-breaking space with a simple normal space.
de: Diese Option ersetzt alle geschützten Leerzeichen mit einem normalen Leerzeichen.

# options.alttitle
source: Select the types of format to be removed
de: Wählen Sie die Formatierungstypen, die entfernt werden sollen

# options.description
source: The format removal operation may remove various types of format.
de: Es können unterschiedliche Typen von Formatierungen entfernt werden.

# options.details
source: Check one or more of these check boxes to select the type(s) of format you wish to be removed.
de: Markieren Sie eine oder mehrere dieser Kontrollkästchen, um die zu entfernenden Formatierungen auszuwählen.

# selection.alttitle
source: Remove format on selected text only
de: Formatierung nur für ausgewählten Inhalt entfernen

# selection.description
source: Select this option to perform the format removal operation on the currently selected text only.
de: Wählen Sie diese Option, um die Formatierung nur für den aktuell ausgewählten Inhalt zu entfernen.

# typographicalPunctuation.alttitle
source: Replace typographical punctuation
de: Typografische Zeichensetzung ersetzen

# typographicalPunctuation.description
source: Check this option if you wish to replace typographical punctuation with ASCII character codes.
de: Markieren Sie diese Option, wenn Sie typografische Satzzeichen durch ASCII-Zeichen ersetzen möchten.

# typographicalPunctuation.details
source: This option replaces typographical punctuation entities with ASCII character codes. The following substitutions are performed: - replace horizontal ellipsis with three periods; - replace en-dash and em-dash with hyphen; - replace double low-9, left double and right double quotation mark with double quote; - replace left single, right single and single low-9 quotation mark with single quote; - replace single left/right-pointing angle quotation mark with single quote; - replace left/right-pointing double angle quotation mark (also known as left/right pointing guillemet) with double quote; - replace grave accent (spacing grave) and acute accent (spacing acute) with single quote.
de: Diese Option ersetzt typografische Zeichen mit ihren ASCII-Entsprechungen. Die folgenden Ersetzungen werden durchgeführt: - Waagerechte Auslassungspunkte werden ersetzt durch drei Punkte; - kurze und lange Gedankenstriche werden ersetzt durch Bindestriche; - unteres, typografisches sowie doppeltes Anführungszeichen wird ersetzt durch Standardanführungszeichen; - unteres sowie einfaches Anführungszeichen wird ersetzt durch einfaches Anführungszeichen;- einfaches Guillemet wird ersetzt durch einfaches Anführungszeichen; - Guillemet wird ersetzt durch Standardanführungszeichen; - Gravis und Akut werden ersetzt durch einfaches Anführungszeichen.
